## 🚀 Terragrunt Apply Completed

**Project**: claude-code-action
**Environment**: `develop`
**Directory**: `infrastructures/claude-code-action/terragrunt/envs/develop`
**Status**: ✅ Success
**Action**: apply

<details>
<summary>📝 Apply Output</summary>

```hcl
07:51:45.462 INFO   Downloading Terraform configurations from ../../modules into ./.terragrunt-cache/my1UPtLMQLjicnyXBzdFZQO2ZLc/lpQGwm1_HFfaA93KgqixzLjaxyE
07:51:46.624 INFO   terraform: Initializing the backend...
07:51:48.053 INFO   terraform: 
07:51:48.054 INFO   terraform: Successfully configured the backend "s3"! Terraform will automatically
07:51:48.054 INFO   terraform: use this backend unless the backend configuration changes.
07:51:49.135 INFO   terraform: Initializing provider plugins...
07:51:49.135 INFO   terraform: - Finding hashicorp/tls versions matching "~> 4.0"...
07:51:49.187 INFO   terraform: - Finding hashicorp/aws versions matching "~> 5.0"...
07:51:49.536 INFO   terraform: - Installing hashicorp/aws v5.100.0...
07:51:53.636 INFO   terraform: - Installed hashicorp/aws v5.100.0 (signed by HashiCorp)
07:51:53.705 INFO   terraform: - Installing hashicorp/tls v4.1.0...
07:51:53.910 INFO   terraform: - Installed hashicorp/tls v4.1.0 (signed by HashiCorp)
07:51:53.910 INFO   terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:51:53.910 INFO   terraform: selections it made above. Include this file in your version control repository
07:51:53.910 INFO   terraform: so that Terraform can guarantee to make the same selections by default when
07:51:53.910 INFO   terraform: you run "terraform init" in the future.
07:51:53.910 INFO   terraform: Terraform has been successfully initialized!
07:51:56.430 STDOUT terraform: Acquiring state lock. This may take a few moments...
07:51:59.421 STDOUT terraform: data.aws_caller_identity.current: Reading...
07:51:59.586 STDOUT terraform: data.aws_caller_identity.current: Read complete after 1s [id=559744160976]
07:51:59.711 STDOUT terraform: Terraform used the selected providers to generate the following execution
07:51:59.712 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
07:51:59.712 STDOUT terraform:   + create
07:51:59.712 STDOUT terraform: Terraform will perform the following actions:
07:51:59.712 STDOUT terraform:   # aws_iam_policy.bedrock_claude_policy will be created
07:51:59.712 STDOUT terraform:   + resource "aws_iam_policy" "bedrock_claude_policy" {
07:51:59.712 STDOUT terraform:       + arn              = (known after apply)
07:51:59.712 STDOUT terraform:       + attachment_count = (known after apply)
07:51:59.712 STDOUT terraform:       + description      = "Policy for Claude Code Action to access Amazon Bedrock Claude models"
07:51:59.712 STDOUT terraform:       + id               = (known after apply)
07:51:59.712 STDOUT terraform:       + name             = "claude-code-action-monorepo-bedrock-claude-policy"
07:51:59.712 STDOUT terraform:       + name_prefix      = (known after apply)
07:51:59.712 STDOUT terraform:       + path             = "/"
07:51:59.712 STDOUT terraform:       + policy           = jsonencode(
07:51:59.712 STDOUT terraform:             {
07:51:59.712 STDOUT terraform:               + Statement = [
07:51:59.712 STDOUT terraform:                   + {
07:51:59.712 STDOUT terraform:                       + Action   = [
07:51:59.712 STDOUT terraform:                           + "bedrock:InvokeModel",
07:51:59.712 STDOUT terraform:                           + "bedrock:InvokeModelWithResponseStream",
07:51:59.712 STDOUT terraform:                         ]
07:51:59.712 STDOUT terraform:                       + Effect   = "Allow"
07:51:59.712 STDOUT terraform:                       + Resource = "*"
07:51:59.712 STDOUT terraform:                     },
07:51:59.712 STDOUT terraform:                   + {
07:51:59.712 STDOUT terraform:                       + Action   = [
07:51:59.712 STDOUT terraform:                           + "bedrock:ListFoundationModels",
07:51:59.713 STDOUT terraform:                           + "bedrock:GetFoundationModel",
07:51:59.713 STDOUT terraform:                         ]
07:51:59.713 STDOUT terraform:                       + Effect   = "Allow"
07:51:59.713 STDOUT terraform:                       + Resource = "*"
07:51:59.713 STDOUT terraform:                     },
07:51:59.713 STDOUT terraform:                 ]
07:51:59.713 STDOUT terraform:               + Version   = "2012-10-17"
07:51:59.713 STDOUT terraform:             }
07:51:59.713 STDOUT terraform:         )
07:51:59.713 STDOUT terraform:       + policy_id        = (known after apply)
07:51:59.713 STDOUT terraform:       + tags             = {
07:51:59.713 STDOUT terraform:           + "CostCenter"  = "engineering"
07:51:59.713 STDOUT terraform:           + "Environment" = "monorepo"
07:51:59.713 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
07:51:59.713 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-bedrock-claude-policy"
07:51:59.713 STDOUT terraform:           + "Owner"       = "panicboat"
07:51:59.713 STDOUT terraform:           + "Project"     = "claude-code-action"
07:51:59.713 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
07:51:59.713 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
07:51:59.713 STDOUT terraform:         }
07:51:59.713 STDOUT terraform:       + tags_all         = {
07:51:59.713 STDOUT terraform:           + "CostCenter"  = "engineering"
07:51:59.713 STDOUT terraform:           + "Environment" = "monorepo"
07:51:59.713 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
07:51:59.713 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-bedrock-claude-policy"
07:51:59.713 STDOUT terraform:           + "Owner"       = "panicboat"
07:51:59.713 STDOUT terraform:           + "Project"     = "claude-code-action"
07:51:59.713 STDOUT terraform:           + "Purpose"     = "bedrock-claude-access"
07:51:59.714 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
07:51:59.714 STDOUT terraform:         }
07:51:59.714 STDOUT terraform:     }
07:51:59.714 STDOUT terraform:   # aws_iam_role.claude_code_action_role will be created
07:51:59.714 STDOUT terraform:   + resource "aws_iam_role" "claude_code_action_role" {
07:51:59.714 STDOUT terraform:       + arn                   = (known after apply)
07:51:59.714 STDOUT terraform:       + assume_role_policy    = jsonencode(
07:51:59.714 STDOUT terraform:             {
07:51:59.714 STDOUT terraform:               + Statement = [
07:51:59.714 STDOUT terraform:                   + {
07:51:59.714 STDOUT terraform:                       + Action    = "sts:AssumeRoleWithWebIdentity"
07:51:59.714 STDOUT terraform:                       + Condition = {
07:51:59.714 STDOUT terraform:                           + StringEquals = {
07:51:59.714 STDOUT terraform:                               + "token.actions.githubusercontent.com:aud" = "sts.amazonaws.com"
07:51:59.714 STDOUT terraform:                             }
07:51:59.714 STDOUT terraform:                           + StringLike   = {
07:51:59.714 STDOUT terraform:                               + "token.actions.githubusercontent.com:sub" = "repo:panicboat/monorepo:*"
07:51:59.714 STDOUT terraform:                             }
07:51:59.714 STDOUT terraform:                         }
07:51:59.714 STDOUT terraform:                       + Effect    = "Allow"
07:51:59.714 STDOUT terraform:                       + Principal = {
07:51:59.714 STDOUT terraform:                           + Federated = "arn:aws:iam::559744160976:oidc-provider/token.actions.githubusercontent.com"
07:51:59.718 STDOUT terraform:                         }
07:51:59.718 STDOUT terraform:                     },
07:51:59.718 STDOUT terraform:                 ]
07:51:59.718 STDOUT terraform:               + Version   = "2012-10-17"
07:51:59.718 STDOUT terraform:             }
07:51:59.718 STDOUT terraform:         )
07:51:59.718 STDOUT terraform:       + create_date           = (known after apply)
07:51:59.718 STDOUT terraform:       + force_detach_policies = false
07:51:59.719 STDOUT terraform:       + id                    = (known after apply)
07:51:59.719 STDOUT terraform:       + managed_policy_arns   = (known after apply)
07:51:59.719 STDOUT terraform:       + max_session_duration  = 7200
07:51:59.719 STDOUT terraform:       + name                  = "claude-code-action-monorepo-github-actions-role"
07:51:59.719 STDOUT terraform:       + name_prefix           = (known after apply)
07:51:59.719 STDOUT terraform:       + path                  = "/"
07:51:59.719 STDOUT terraform:       + tags                  = {
07:51:59.719 STDOUT terraform:           + "CostCenter"  = "engineering"
07:51:59.719 STDOUT terraform:           + "Environment" = "monorepo"
07:51:59.719 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
07:51:59.719 STDOUT terraform:           + "GitHubRepo"  = "monorepo"
07:51:59.720 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
07:51:59.720 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-github-actions-role"
07:51:59.720 STDOUT terraform:           + "Owner"       = "panicboat"
07:51:59.720 STDOUT terraform:           + "Project"     = "claude-code-action"
07:51:59.720 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
07:51:59.720 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
07:51:59.720 STDOUT terraform:         }
07:51:59.720 STDOUT terraform:       + tags_all              = {
07:51:59.720 STDOUT terraform:           + "CostCenter"  = "engineering"
07:51:59.720 STDOUT terraform:           + "Environment" = "monorepo"
07:51:59.721 STDOUT terraform:           + "GitHubOrg"   = "panicboat"
07:51:59.721 STDOUT terraform:           + "GitHubRepo"  = "monorepo"
07:51:59.721 STDOUT terraform:           + "ManagedBy"   = "terragrunt"
07:51:59.721 STDOUT terraform:           + "Name"        = "claude-code-action-monorepo-github-actions-role"
07:51:59.721 STDOUT terraform:           + "Owner"       = "panicboat"
07:51:59.721 STDOUT terraform:           + "Project"     = "claude-code-action"
07:51:59.722 STDOUT terraform:           + "Purpose"     = "claude-code-action-bedrock"
07:51:59.722 STDOUT terraform:           + "Repository"  = "panicboat/monorepo"
07:51:59.722 STDOUT terraform:         }
07:51:59.722 STDOUT terraform:       + unique_id             = (known after apply)
07:51:59.723 STDOUT terraform:       + inline_policy (known after apply)
07:51:59.723 STDOUT terraform:     }
07:51:59.723 STDOUT terraform:   # aws_iam_role_policy_attachment.bedrock_claude_policy_attachment will be created
07:51:59.723 STDOUT terraform:   + resource "aws_iam_role_policy_attachment" "bedrock_claude_policy_attachment" {
07:51:59.723 STDOUT terraform:       + id         = (known after apply)
07:51:59.723 STDOUT terraform:       + policy_arn = (known after apply)
07:51:59.723 STDOUT terraform:       + role       = "claude-code-action-monorepo-github-actions-role"
07:51:59.723 STDOUT terraform:     }
07:51:59.723 STDOUT terraform: Plan: 3 to add, 0 to change, 0 to destroy.
07:51:59.723 STDOUT terraform: 
07:51:59.723 STDOUT terraform: Changes to Outputs:
07:51:59.723 STDOUT terraform:   + bedrock_models               = [
07:51:59.723 STDOUT terraform:       + "anthropic.claude-3-7-sonnet-20250219-v1:0",
07:51:59.723 STDOUT terraform:     ]
07:51:59.723 STDOUT terraform:   + bedrock_policy_arn           = (known after apply)
07:51:59.723 STDOUT terraform:   + claude_model_region          = "us-west-2"
07:51:59.723 STDOUT terraform:   + github_actions_configuration = {
07:51:59.723 STDOUT terraform:       + aws_region          = "ap-northeast-1"
07:51:59.725 STDOUT terraform:       + bedrock_models      = [
07:51:59.725 STDOUT terraform:           + "anthropic.claude-3-7-sonnet-20250219-v1:0",
07:51:59.725 STDOUT terraform:         ]
07:51:59.725 STDOUT terraform:       + claude_model_region = "us-west-2"
07:51:59.725 STDOUT terraform:       + role_arn            = (known after apply)
07:51:59.725 STDOUT terraform:     }
07:51:59.725 STDOUT terraform:   + iam_role_arn                 = (known after apply)
07:51:59.725 STDOUT terraform:   + iam_role_name                = "claude-code-action-monorepo-github-actions-role"
07:52:00.680 STDOUT terraform: aws_iam_policy.bedrock_claude_policy: Creating...
07:52:00.680 STDOUT terraform: aws_iam_role.claude_code_action_role: Creating...
07:52:00.930 STDOUT terraform: aws_iam_policy.bedrock_claude_policy: Creation complete after 0s [id=arn:aws:iam::559744160976:policy/claude-code-action-monorepo-bedrock-claude-policy]
07:52:00.942 STDOUT terraform: aws_iam_role.claude_code_action_role: Creation complete after 0s [id=claude-code-action-monorepo-github-actions-role]
07:52:00.944 STDOUT terraform: aws_iam_role_policy_attachment.bedrock_claude_policy_attachment: Creating...
07:52:01.021 STDOUT terraform: aws_iam_role_policy_attachment.bedrock_claude_policy_attachment: Creation complete after 0s [id=claude-code-action-monorepo-github-actions-role-20250622075200993400000001]
07:52:01.888 STDOUT terraform: 
07:52:01.888 STDOUT terraform: Apply complete! Resources: 3 added, 0 changed, 0 destroyed.
07:52:01.888 STDOUT terraform: 
07:52:01.888 STDOUT terraform: Outputs:
07:52:01.888 STDOUT terraform: 
07:52:01.888 STDOUT terraform: bedrock_models = tolist([
07:52:01.888 STDOUT terraform:   "anthropic.claude-3-7-sonnet-20250219-v1:0",
07:52:01.888 STDOUT terraform: ])
07:52:01.888 STDOUT terraform: bedrock_policy_arn = "arn:aws:iam::559744160976:policy/claude-code-action-monorepo-bedrock-claude-policy"
07:52:01.888 STDOUT terraform: claude_model_region = "us-west-2"
07:52:01.888 STDOUT terraform: github_actions_configuration = {
07:52:01.888 STDOUT terraform:   "aws_region" = "ap-northeast-1"
07:52:01.888 STDOUT terraform:   "bedrock_models" = tolist([
07:52:01.888 STDOUT terraform:     "anthropic.claude-3-7-sonnet-20250219-v1:0",
07:52:01.888 STDOUT terraform:   ])
07:52:01.888 STDOUT terraform:   "claude_model_region" = "us-west-2"
07:52:01.888 STDOUT terraform:   "role_arn" = "arn:aws:iam::559744160976:role/claude-code-action-monorepo-github-actions-role"
07:52:01.888 STDOUT terraform: }
07:52:01.888 STDOUT terraform: iam_role_arn = "arn:aws:iam::559744160976:role/claude-code-action-monorepo-github-actions-role"
07:52:01.888 STDOUT terraform: iam_role_name = "claude-code-action-monorepo-github-actions-role"
```
</details>

[View full workflow logs](https://github.com/panicboat/monorepo/actions/runs/15804400985)
---
*Triggered by workflow automation system*
<!-- thollander/actions-comment-pull-request "terragrunt-apply-develop-claude-code-action" -->